In [10]:
import pyodbc
import pandas as pd
import numpy as np

### Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [ ]:
Sol:
    SELECT REPLACE(FIRST_NAME,'a','A') as First_Name  FROM worker

### Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [ ]:
Sol:
    SELECT * FROM worker ORDER BY First_Name ASC, Department DESC

### Write an SQL query to fetch the names of workers who earn the highest salary.

In [ ]:
Sol:
    SELECT First_Name, Salary from worker WHERE Salary=(SELECT max(Salary) from worker)